; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l8-t1-p6---int100n150-m25---int100c150---s150---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 l7 - location
t0 - truck
p0 p1 p2 p3 p4 p5 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 level111 level112 level113 level114 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level2 level2)
(sum level0 level13 level13)
(sum level0 level16 level16)
(sum level0 level18 level18)
(sum level0 level22 level22)
(sum level0 level23 level23)
(sum level1 level1 level2)
(sum level1 level2 level3)
(sum level1 level13 level14)
(sum level1 level16 level17)
(sum level1 level18 level19)
(sum level1 level22 level23)
(sum level1 level23 level24)
(sum level2 level1 level3)
(sum level2 level2 level4)
(sum level2 level13 level15)
(sum level2 level16 level18)
(sum level2 level18 level20)
(sum level2 level22 level24)
(sum level2 level23 level25)
(sum level3 level1 level4)
(sum level3 level2 level5)
(sum level3 level13 level16)
(sum level3 level16 level19)
(sum level3 level18 level21)
(sum level3 level22 level25)
(sum level3 level23 level26)
(sum level4 level1 level5)
(sum level4 level2 level6)
(sum level4 level13 level17)
(sum level4 level16 level20)
(sum level4 level18 level22)
(sum level4 level22 level26)
(sum level4 level23 level27)
(sum level5 level1 level6)
(sum level5 level2 level7)
(sum level5 level13 level18)
(sum level5 level16 level21)
(sum level5 level18 level23)
(sum level5 level22 level27)
(sum level5 level23 level28)
(sum level6 level1 level7)
(sum level6 level2 level8)
(sum level6 level13 level19)
(sum level6 level16 level22)
(sum level6 level18 level24)
(sum level6 level22 level28)
(sum level6 level23 level29)
(sum level7 level1 level8)
(sum level7 level2 level9)
(sum level7 level13 level20)
(sum level7 level16 level23)
(sum level7 level18 level25)
(sum level7 level22 level29)
(sum level7 level23 level30)
(sum level8 level1 level9)
(sum level8 level2 level10)
(sum level8 level13 level21)
(sum level8 level16 level24)
(sum level8 level18 level26)
(sum level8 level22 level30)
(sum level8 level23 level31)
(sum level9 level1 level10)
(sum level9 level2 level11)
(sum level9 level13 level22)
(sum level9 level16 level25)
(sum level9 level18 level27)
(sum level9 level22 level31)
(sum level9 level23 level32)
(sum level10 level1 level11)
(sum level10 level2 level12)
(sum level10 level13 level23)
(sum level10 level16 level26)
(sum level10 level18 level28)
(sum level10 level22 level32)
(sum level10 level23 level33)
(sum level11 level1 level12)
(sum level11 level2 level13)
(sum level11 level13 level24)
(sum level11 level16 level27)
(sum level11 level18 level29)
(sum level11 level22 level33)
(sum level11 level23 level34)
(sum level12 level1 level13)
(sum level12 level2 level14)
(sum level12 level13 level25)
(sum level12 level16 level28)
(sum level12 level18 level30)
(sum level12 level22 level34)
(sum level12 level23 level35)
(sum level13 level1 level14)
(sum level13 level2 level15)
(sum level13 level13 level26)
(sum level13 level16 level29)
(sum level13 level18 level31)
(sum level13 level22 level35)
(sum level13 level23 level36)
(sum level14 level1 level15)
(sum level14 level2 level16)
(sum level14 level13 level27)
(sum level14 level16 level30)
(sum level14 level18 level32)
(sum level14 level22 level36)
(sum level14 level23 level37)
(sum level15 level1 level16)
(sum level15 level2 level17)
(sum level15 level13 level28)
(sum level15 level16 level31)
(sum level15 level18 level33)
(sum level15 level22 level37)
(sum level15 level23 level38)
(sum level16 level1 level17)
(sum level16 level2 level18)
(sum level16 level13 level29)
(sum level16 level16 level32)
(sum level16 level18 level34)
(sum level16 level22 level38)
(sum level16 level23 level39)
(sum level17 level1 level18)
(sum level17 level2 level19)
(sum level17 level13 level30)
(sum level17 level16 level33)
(sum level17 level18 level35)
(sum level17 level22 level39)
(sum level17 level23 level40)
(sum level18 level1 level19)
(sum level18 level2 level20)
(sum level18 level13 level31)
(sum level18 level16 level34)
(sum level18 level18 level36)
(sum level18 level22 level40)
(sum level18 level23 level41)
(sum level19 level1 level20)
(sum level19 level2 level21)
(sum level19 level13 level32)
(sum level19 level16 level35)
(sum level19 level18 level37)
(sum level19 level22 level41)
(sum level19 level23 level42)
(sum level20 level1 level21)
(sum level20 level2 level22)
(sum level20 level13 level33)
(sum level20 level16 level36)
(sum level20 level18 level38)
(sum level20 level22 level42)
(sum level20 level23 level43)
(sum level21 level1 level22)
(sum level21 level2 level23)
(sum level21 level13 level34)
(sum level21 level16 level37)
(sum level21 level18 level39)
(sum level21 level22 level43)
(sum level21 level23 level44)
(sum level22 level1 level23)
(sum level22 level2 level24)
(sum level22 level13 level35)
(sum level22 level16 level38)
(sum level22 level18 level40)
(sum level22 level22 level44)
(sum level22 level23 level45)
(sum level23 level1 level24)
(sum level23 level2 level25)
(sum level23 level13 level36)
(sum level23 level16 level39)
(sum level23 level18 level41)
(sum level23 level22 level45)
(sum level23 level23 level46)
(sum level24 level1 level25)
(sum level24 level2 level26)
(sum level24 level13 level37)
(sum level24 level16 level40)
(sum level24 level18 level42)
(sum level24 level22 level46)
(sum level24 level23 level47)
(sum level25 level1 level26)
(sum level25 level2 level27)
(sum level25 level13 level38)
(sum level25 level16 level41)
(sum level25 level18 level43)
(sum level25 level22 level47)
(sum level25 level23 level48)
(sum level26 level1 level27)
(sum level26 level2 level28)
(sum level26 level13 level39)
(sum level26 level16 level42)
(sum level26 level18 level44)
(sum level26 level22 level48)
(sum level26 level23 level49)
(sum level27 level1 level28)
(sum level27 level2 level29)
(sum level27 level13 level40)
(sum level27 level16 level43)
(sum level27 level18 level45)
(sum level27 level22 level49)
(sum level27 level23 level50)
(sum level28 level1 level29)
(sum level28 level2 level30)
(sum level28 level13 level41)
(sum level28 level16 level44)
(sum level28 level18 level46)
(sum level28 level22 level50)
(sum level28 level23 level51)
(sum level29 level1 level30)
(sum level29 level2 level31)
(sum level29 level13 level42)
(sum level29 level16 level45)
(sum level29 level18 level47)
(sum level29 level22 level51)
(sum level29 level23 level52)
(sum level30 level1 level31)
(sum level30 level2 level32)
(sum level30 level13 level43)
(sum level30 level16 level46)
(sum level30 level18 level48)
(sum level30 level22 level52)
(sum level30 level23 level53)
(sum level31 level1 level32)
(sum level31 level2 level33)
(sum level31 level13 level44)
(sum level31 level16 level47)
(sum level31 level18 level49)
(sum level31 level22 level53)
(sum level31 level23 level54)
(sum level32 level1 level33)
(sum level32 level2 level34)
(sum level32 level13 level45)
(sum level32 level16 level48)
(sum level32 level18 level50)
(sum level32 level22 level54)
(sum level32 level23 level55)
(sum level33 level1 level34)
(sum level33 level2 level35)
(sum level33 level13 level46)
(sum level33 level16 level49)
(sum level33 level18 level51)
(sum level33 level22 level55)
(sum level33 level23 level56)
(sum level34 level1 level35)
(sum level34 level2 level36)
(sum level34 level13 level47)
(sum level34 level16 level50)
(sum level34 level18 level52)
(sum level34 level22 level56)
(sum level34 level23 level57)
(sum level35 level1 level36)
(sum level35 level2 level37)
(sum level35 level13 level48)
(sum level35 level16 level51)
(sum level35 level18 level53)
(sum level35 level22 level57)
(sum level35 level23 level58)
(sum level36 level1 level37)
(sum level36 level2 level38)
(sum level36 level13 level49)
(sum level36 level16 level52)
(sum level36 level18 level54)
(sum level36 level22 level58)
(sum level36 level23 level59)
(sum level37 level1 level38)
(sum level37 level2 level39)
(sum level37 level13 level50)
(sum level37 level16 level53)
(sum level37 level18 level55)
(sum level37 level22 level59)
(sum level37 level23 level60)
(sum level38 level1 level39)
(sum level38 level2 level40)
(sum level38 level13 level51)
(sum level38 level16 level54)
(sum level38 level18 level56)
(sum level38 level22 level60)
(sum level38 level23 level61)
(sum level39 level1 level40)
(sum level39 level2 level41)
(sum level39 level13 level52)
(sum level39 level16 level55)
(sum level39 level18 level57)
(sum level39 level22 level61)
(sum level39 level23 level62)
(sum level40 level1 level41)
(sum level40 level2 level42)
(sum level40 level13 level53)
(sum level40 level16 level56)
(sum level40 level18 level58)
(sum level40 level22 level62)
(sum level40 level23 level63)
(sum level41 level1 level42)
(sum level41 level2 level43)
(sum level41 level13 level54)
(sum level41 level16 level57)
(sum level41 level18 level59)
(sum level41 level22 level63)
(sum level41 level23 level64)
(sum level42 level1 level43)
(sum level42 level2 level44)
(sum level42 level13 level55)
(sum level42 level16 level58)
(sum level42 level18 level60)
(sum level42 level22 level64)
(sum level42 level23 level65)
(sum level43 level1 level44)
(sum level43 level2 level45)
(sum level43 level13 level56)
(sum level43 level16 level59)
(sum level43 level18 level61)
(sum level43 level22 level65)
(sum level43 level23 level66)
(sum level44 level1 level45)
(sum level44 level2 level46)
(sum level44 level13 level57)
(sum level44 level16 level60)
(sum level44 level18 level62)
(sum level44 level22 level66)
(sum level44 level23 level67)
(sum level45 level1 level46)
(sum level45 level2 level47)
(sum level45 level13 level58)
(sum level45 level16 level61)
(sum level45 level18 level63)
(sum level45 level22 level67)
(sum level45 level23 level68)
(sum level46 level1 level47)
(sum level46 level2 level48)
(sum level46 level13 level59)
(sum level46 level16 level62)
(sum level46 level18 level64)
(sum level46 level22 level68)
(sum level46 level23 level69)
(sum level47 level1 level48)
(sum level47 level2 level49)
(sum level47 level13 level60)
(sum level47 level16 level63)
(sum level47 level18 level65)
(sum level47 level22 level69)
(sum level47 level23 level70)
(sum level48 level1 level49)
(sum level48 level2 level50)
(sum level48 level13 level61)
(sum level48 level16 level64)
(sum level48 level18 level66)
(sum level48 level22 level70)
(sum level48 level23 level71)
(sum level49 level1 level50)
(sum level49 level2 level51)
(sum level49 level13 level62)
(sum level49 level16 level65)
(sum level49 level18 level67)
(sum level49 level22 level71)
(sum level49 level23 level72)
(sum level50 level1 level51)
(sum level50 level2 level52)
(sum level50 level13 level63)
(sum level50 level16 level66)
(sum level50 level18 level68)
(sum level50 level22 level72)
(sum level50 level23 level73)
(sum level51 level1 level52)
(sum level51 level2 level53)
(sum level51 level13 level64)
(sum level51 level16 level67)
(sum level51 level18 level69)
(sum level51 level22 level73)
(sum level51 level23 level74)
(sum level52 level1 level53)
(sum level52 level2 level54)
(sum level52 level13 level65)
(sum level52 level16 level68)
(sum level52 level18 level70)
(sum level52 level22 level74)
(sum level52 level23 level75)
(sum level53 level1 level54)
(sum level53 level2 level55)
(sum level53 level13 level66)
(sum level53 level16 level69)
(sum level53 level18 level71)
(sum level53 level22 level75)
(sum level53 level23 level76)
(sum level54 level1 level55)
(sum level54 level2 level56)
(sum level54 level13 level67)
(sum level54 level16 level70)
(sum level54 level18 level72)
(sum level54 level22 level76)
(sum level54 level23 level77)
(sum level55 level1 level56)
(sum level55 level2 level57)
(sum level55 level13 level68)
(sum level55 level16 level71)
(sum level55 level18 level73)
(sum level55 level22 level77)
(sum level55 level23 level78)
(sum level56 level1 level57)
(sum level56 level2 level58)
(sum level56 level13 level69)
(sum level56 level16 level72)
(sum level56 level18 level74)
(sum level56 level22 level78)
(sum level56 level23 level79)
(sum level57 level1 level58)
(sum level57 level2 level59)
(sum level57 level13 level70)
(sum level57 level16 level73)
(sum level57 level18 level75)
(sum level57 level22 level79)
(sum level57 level23 level80)
(sum level58 level1 level59)
(sum level58 level2 level60)
(sum level58 level13 level71)
(sum level58 level16 level74)
(sum level58 level18 level76)
(sum level58 level22 level80)
(sum level58 level23 level81)
(sum level59 level1 level60)
(sum level59 level2 level61)
(sum level59 level13 level72)
(sum level59 level16 level75)
(sum level59 level18 level77)
(sum level59 level22 level81)
(sum level59 level23 level82)
(sum level60 level1 level61)
(sum level60 level2 level62)
(sum level60 level13 level73)
(sum level60 level16 level76)
(sum level60 level18 level78)
(sum level60 level22 level82)
(sum level60 level23 level83)
(sum level61 level1 level62)
(sum level61 level2 level63)
(sum level61 level13 level74)
(sum level61 level16 level77)
(sum level61 level18 level79)
(sum level61 level22 level83)
(sum level61 level23 level84)
(sum level62 level1 level63)
(sum level62 level2 level64)
(sum level62 level13 level75)
(sum level62 level16 level78)
(sum level62 level18 level80)
(sum level62 level22 level84)
(sum level62 level23 level85)
(sum level63 level1 level64)
(sum level63 level2 level65)
(sum level63 level13 level76)
(sum level63 level16 level79)
(sum level63 level18 level81)
(sum level63 level22 level85)
(sum level63 level23 level86)
(sum level64 level1 level65)
(sum level64 level2 level66)
(sum level64 level13 level77)
(sum level64 level16 level80)
(sum level64 level18 level82)
(sum level64 level22 level86)
(sum level64 level23 level87)
(sum level65 level1 level66)
(sum level65 level2 level67)
(sum level65 level13 level78)
(sum level65 level16 level81)
(sum level65 level18 level83)
(sum level65 level22 level87)
(sum level65 level23 level88)
(sum level66 level1 level67)
(sum level66 level2 level68)
(sum level66 level13 level79)
(sum level66 level16 level82)
(sum level66 level18 level84)
(sum level66 level22 level88)
(sum level66 level23 level89)
(sum level67 level1 level68)
(sum level67 level2 level69)
(sum level67 level13 level80)
(sum level67 level16 level83)
(sum level67 level18 level85)
(sum level67 level22 level89)
(sum level67 level23 level90)
(sum level68 level1 level69)
(sum level68 level2 level70)
(sum level68 level13 level81)
(sum level68 level16 level84)
(sum level68 level18 level86)
(sum level68 level22 level90)
(sum level68 level23 level91)
(sum level69 level1 level70)
(sum level69 level2 level71)
(sum level69 level13 level82)
(sum level69 level16 level85)
(sum level69 level18 level87)
(sum level69 level22 level91)
(sum level69 level23 level92)
(sum level70 level1 level71)
(sum level70 level2 level72)
(sum level70 level13 level83)
(sum level70 level16 level86)
(sum level70 level18 level88)
(sum level70 level22 level92)
(sum level70 level23 level93)
(sum level71 level1 level72)
(sum level71 level2 level73)
(sum level71 level13 level84)
(sum level71 level16 level87)
(sum level71 level18 level89)
(sum level71 level22 level93)
(sum level71 level23 level94)
(sum level72 level1 level73)
(sum level72 level2 level74)
(sum level72 level13 level85)
(sum level72 level16 level88)
(sum level72 level18 level90)
(sum level72 level22 level94)
(sum level72 level23 level95)
(sum level73 level1 level74)
(sum level73 level2 level75)
(sum level73 level13 level86)
(sum level73 level16 level89)
(sum level73 level18 level91)
(sum level73 level22 level95)
(sum level73 level23 level96)
(sum level74 level1 level75)
(sum level74 level2 level76)
(sum level74 level13 level87)
(sum level74 level16 level90)
(sum level74 level18 level92)
(sum level74 level22 level96)
(sum level74 level23 level97)
(sum level75 level1 level76)
(sum level75 level2 level77)
(sum level75 level13 level88)
(sum level75 level16 level91)
(sum level75 level18 level93)
(sum level75 level22 level97)
(sum level75 level23 level98)
(sum level76 level1 level77)
(sum level76 level2 level78)
(sum level76 level13 level89)
(sum level76 level16 level92)
(sum level76 level18 level94)
(sum level76 level22 level98)
(sum level76 level23 level99)
(sum level77 level1 level78)
(sum level77 level2 level79)
(sum level77 level13 level90)
(sum level77 level16 level93)
(sum level77 level18 level95)
(sum level77 level22 level99)
(sum level77 level23 level100)
(sum level78 level1 level79)
(sum level78 level2 level80)
(sum level78 level13 level91)
(sum level78 level16 level94)
(sum level78 level18 level96)
(sum level78 level22 level100)
(sum level78 level23 level101)
(sum level79 level1 level80)
(sum level79 level2 level81)
(sum level79 level13 level92)
(sum level79 level16 level95)
(sum level79 level18 level97)
(sum level79 level22 level101)
(sum level79 level23 level102)
(sum level80 level1 level81)
(sum level80 level2 level82)
(sum level80 level13 level93)
(sum level80 level16 level96)
(sum level80 level18 level98)
(sum level80 level22 level102)
(sum level80 level23 level103)
(sum level81 level1 level82)
(sum level81 level2 level83)
(sum level81 level13 level94)
(sum level81 level16 level97)
(sum level81 level18 level99)
(sum level81 level22 level103)
(sum level81 level23 level104)
(sum level82 level1 level83)
(sum level82 level2 level84)
(sum level82 level13 level95)
(sum level82 level16 level98)
(sum level82 level18 level100)
(sum level82 level22 level104)
(sum level82 level23 level105)
(sum level83 level1 level84)
(sum level83 level2 level85)
(sum level83 level13 level96)
(sum level83 level16 level99)
(sum level83 level18 level101)
(sum level83 level22 level105)
(sum level83 level23 level106)
(sum level84 level1 level85)
(sum level84 level2 level86)
(sum level84 level13 level97)
(sum level84 level16 level100)
(sum level84 level18 level102)
(sum level84 level22 level106)
(sum level84 level23 level107)
(sum level85 level1 level86)
(sum level85 level2 level87)
(sum level85 level13 level98)
(sum level85 level16 level101)
(sum level85 level18 level103)
(sum level85 level22 level107)
(sum level85 level23 level108)
(sum level86 level1 level87)
(sum level86 level2 level88)
(sum level86 level13 level99)
(sum level86 level16 level102)
(sum level86 level18 level104)
(sum level86 level22 level108)
(sum level86 level23 level109)
(sum level87 level1 level88)
(sum level87 level2 level89)
(sum level87 level13 level100)
(sum level87 level16 level103)
(sum level87 level18 level105)
(sum level87 level22 level109)
(sum level87 level23 level110)
(sum level88 level1 level89)
(sum level88 level2 level90)
(sum level88 level13 level101)
(sum level88 level16 level104)
(sum level88 level18 level106)
(sum level88 level22 level110)
(sum level88 level23 level111)
(sum level89 level1 level90)
(sum level89 level2 level91)
(sum level89 level13 level102)
(sum level89 level16 level105)
(sum level89 level18 level107)
(sum level89 level22 level111)
(sum level89 level23 level112)
(sum level90 level1 level91)
(sum level90 level2 level92)
(sum level90 level13 level103)
(sum level90 level16 level106)
(sum level90 level18 level108)
(sum level90 level22 level112)
(sum level90 level23 level113)
(sum level91 level1 level92)
(sum level91 level2 level93)
(sum level91 level13 level104)
(sum level91 level16 level107)
(sum level91 level18 level109)
(sum level91 level22 level113)
(sum level91 level23 level114)
(sum level92 level1 level93)
(sum level92 level2 level94)
(sum level92 level13 level105)
(sum level92 level16 level108)
(sum level92 level18 level110)
(sum level92 level22 level114)
(sum level93 level1 level94)
(sum level93 level2 level95)
(sum level93 level13 level106)
(sum level93 level16 level109)
(sum level93 level18 level111)
(sum level94 level1 level95)
(sum level94 level2 level96)
(sum level94 level13 level107)
(sum level94 level16 level110)
(sum level94 level18 level112)
(sum level95 level1 level96)
(sum level95 level2 level97)
(sum level95 level13 level108)
(sum level95 level16 level111)
(sum level95 level18 level113)
(sum level96 level1 level97)
(sum level96 level2 level98)
(sum level96 level13 level109)
(sum level96 level16 level112)
(sum level96 level18 level114)
(sum level97 level1 level98)
(sum level97 level2 level99)
(sum level97 level13 level110)
(sum level97 level16 level113)
(sum level98 level1 level99)
(sum level98 level2 level100)
(sum level98 level13 level111)
(sum level98 level16 level114)
(sum level99 level1 level100)
(sum level99 level2 level101)
(sum level99 level13 level112)
(sum level100 level1 level101)
(sum level100 level2 level102)
(sum level100 level13 level113)
(sum level101 level1 level102)
(sum level101 level2 level103)
(sum level101 level13 level114)
(sum level102 level1 level103)
(sum level102 level2 level104)
(sum level103 level1 level104)
(sum level103 level2 level105)
(sum level104 level1 level105)
(sum level104 level2 level106)
(sum level105 level1 level106)
(sum level105 level2 level107)
(sum level106 level1 level107)
(sum level106 level2 level108)
(sum level107 level1 level108)
(sum level107 level2 level109)
(sum level108 level1 level109)
(sum level108 level2 level110)
(sum level109 level1 level110)
(sum level109 level2 level111)
(sum level110 level1 level111)
(sum level110 level2 level112)
(sum level111 level1 level112)
(sum level111 level2 level113)
(sum level112 level1 level113)
(sum level112 level2 level114)
(sum level113 level1 level114)

(connected l0 l3)
(fuelcost level23 l0 l3)
(connected l0 l5)
(fuelcost level13 l0 l5)
(connected l0 l6)
(fuelcost level23 l0 l6)
(connected l1 l7)
(fuelcost level1 l1 l7)
(connected l2 l3)
(fuelcost level16 l2 l3)
(connected l2 l4)
(fuelcost level16 l2 l4)
(connected l3 l0)
(fuelcost level23 l3 l0)
(connected l3 l2)
(fuelcost level16 l3 l2)
(connected l3 l5)
(fuelcost level16 l3 l5)
(connected l3 l6)
(fuelcost level18 l3 l6)
(connected l3 l7)
(fuelcost level1 l3 l7)
(connected l4 l2)
(fuelcost level16 l4 l2)
(connected l4 l6)
(fuelcost level22 l4 l6)
(connected l4 l7)
(fuelcost level13 l4 l7)
(connected l5 l0)
(fuelcost level13 l5 l0)
(connected l5 l3)
(fuelcost level16 l5 l3)
(connected l5 l7)
(fuelcost level2 l5 l7)
(connected l6 l0)
(fuelcost level23 l6 l0)
(connected l6 l3)
(fuelcost level18 l6 l3)
(connected l6 l4)
(fuelcost level22 l6 l4)
(connected l7 l1)
(fuelcost level1 l7 l1)
(connected l7 l3)
(fuelcost level1 l7 l3)
(connected l7 l4)
(fuelcost level13 l7 l4)
(connected l7 l5)
(fuelcost level2 l7 l5)

(at t0 l3)
(fuel t0 level114)
(= (total-cost) 0)

(at p0 l0)
(at p1 l3)
(at p2 l4)
(at p3 l5)
(at p4 l5)
(at p5 l7)
)

(:goal
(and
(at p0 l1)
(at p1 l0)
(at p2 l7)
(at p3 l7)
(at p4 l2)
(at p5 l5)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p1 t0 l3)
   deleted: (at p1 l3)
   added: (in p1 t0)
   goals met: 0 of 6
2. (drive t0 l3 l7 level113 level1 level114)
   deleted: (at t0 l3) (fuel t0 level114)
   added: (at t0 l7) (fuel t0 level113)
   goals met: 0 of 6
3. (load p5 t0 l7)
   deleted: (at p5 l7)
   added: (in p5 t0)
   goals met: 0 of 6
4. (drive t0 l7 l5 level111 level2 level113)
   deleted: (at t0 l7) (fuel t0 level113)
   added: (at t0 l5) (fuel t0 level111)
   goals met: 0 of 6
5. (unload p5 t0 l5)
   deleted: (in p5 t0)
   added: (at p5 l5)
   goals met: 1 of 6
6. (load p4 t0 l5)
   deleted: (at p4 l5)
   added: (in p4 t0)
   goals met: 1 of 6
7. (load p3 t0 l5)
   deleted: (at p3 l5)
   added: (in p3 t0)
   goals met: 1 of 6
8. (drive t0 l5 l0 level98 level13 level111)
   deleted: (at t0 l5) (fuel t0 level111)
   added: (at t0 l0) (fuel t0 level98)
   goals met: 1 of 6
9. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 2 of 6
10. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 2 of 6
11. (drive t0 l0 l3 level75 level23 level98)
   deleted: (at t0 l0) (fuel t0 level98)
   added: (at t0 l3) (fuel t0 level75)
   goals met: 2 of 6
12. (drive t0 l3 l2 level59 level16 level75)
   deleted: (at t0 l3) (fuel t0 level75)
   added: (at t0 l2) (fuel t0 level59)
   goals met: 2 of 6
13. (unload p4 t0 l2)
   deleted: (in p4 t0)
   added: (at p4 l2)
   goals met: 3 of 6
14. (drive t0 l2 l4 level43 level16 level59)
   deleted: (at t0 l2) (fuel t0 level59)
   added: (at t0 l4) (fuel t0 level43)
   goals met: 3 of 6
15. (load p2 t0 l4)
   deleted: (at p2 l4)
   added: (in p2 t0)
   goals met: 3 of 6
16. (drive t0 l4 l7 level30 level13 level43)
   deleted: (at t0 l4) (fuel t0 level43)
   added: (at t0 l7) (fuel t0 level30)
   goals met: 3 of 6
17. (unload p2 t0 l7)
   deleted: (in p2 t0)
   added: (at p2 l7)
   goals met: 4 of 6
18. (unload p3 t0 l7)
   deleted: (in p3 t0)
   added: (at p3 l7)
   goals met: 5 of 6
19. (drive t0 l7 l1 level29 level1 level30)
   deleted: (at t0 l7) (fuel t0 level30)
   added: (at t0 l1) (fuel t0 level29)
   goals met: 5 of 6
20. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 6 of 6
